# zip(*iterable) : 동일한 개수로 이루어진 자료형을 묶어 주는 역할

# >>> list(zip([1, 2, 3], [4, 5, 6]))
# [(1, 4), (2, 5), (3, 6)]
# >>> list(zip([1, 2, 3], [4, 5, 6], [7, 8, 9]))
# [(1, 4, 7), (2, 5, 8), (3, 6, 9)]
# >>> list(zip("abc", "def"))
# [('a', 'd'), ('b', 'e'), ('c', 'f')]

list = [1, 2, 3, 4]
list2 = [5, 6, 7, 8]
print("zip(list, list2) = ", zip(list, list2))

# 여러 시퀀스 순회하기.
a = [1, 2, 3, 4, 5]
b = ["aa", 'bb', "cc", "dd"]
c = ["12", "23", "34", "45"]

for a, b, c in zip(a, b, c):      # 요소가 제일 작은 4번만 돈다.
    print(f"a = {a}, b = {b}, c = {c}")
